config.org
#+title: Doom Emacs Configuration
* Table of contents :toc:
- [[#appearance][Appearance]]
  - [[#dashboard][Dashboard]]
  - [[#font][Font]]
  - [[#transparency][Transparency]]
  - [[#doom-theme][Doom theme]]
  - [[#line-numbering][Line numbering]]
- [[#ivy][Ivy]]
- [[#imenu][IMenu]]
- [[#org-mode][Org-mode]]
  - [[#basic-org-mode-setup][Basic org-mode setup]]
  - [[#notifications][Notifications]]
  - [[#org-capture-templates][Org capture templates]]
  - [[#archiving][Archiving]]
  - [[#refile-targets][Refile targets]]
  - [[#org-modern][Org-modern]]
  - [[#org-agenda][Org-agenda]]
  - [[#org-super-agenda][Org-super-agenda]]
  - [[#org-roam][Org-roam]]
  - [[#org-journal][Org-journal]]
  - [[#miscellaneous][Miscellaneous]]
- [[#latex][LaTeX]]
  - [[#higher-resolution-org-mode-latex-preview][Higher resolution Org-mode LaTeX preview]]
  - [[#make-org-mode-latex-previews-work-better-with-black-themes][Make Org-mode LaTeX previews work better with black themes]]
  - [[#highlight-latex-fragments][Highlight LaTeX fragments]]
  - [[#preview-tikz-plots][Preview TikZ plots]]
- [[#novel][Nov.el]]
- [[#elfeed][Elfeed]]
  - [[#keybindings][Keybindings]]
  - [[#elfeed-org][Elfeed-org]]
  - [[#elfeed-score][Elfeed-score]]
  - [[#capture-to-org-roam][Capture to Org-roam]]
- [[#beancount][Beancount]]
- [[#lsp][LSP]]
  - [[#nix][Nix]]
  - [[#lsp-ui][LSP UI]]
- [[#company][Company]]
- [[#miscellaneous-1][Miscellaneous]]
  - [[#rainbow-mode][Rainbow mode]]
  - [[#aggressive-indent-mode][Aggressive indent mode]]
  - [[#better-copy-paste-keybinds][Better copy-paste keybinds]]
  - [[#default-shell][Default shell]]

* Appearance
** Dashboard
#+begin_src emacs-lisp
(defun dysthesis/dashboard-setup ()
  (let* ((banner '("                                   "
	           "                                   "
	           "                                   "
	           "   ⣴⣶⣤⡤⠦⣤⣀⣤⠆     ⣈⣭⣿⣶⣿⣦⣼⣆          "
	           "    ⠉⠻⢿⣿⠿⣿⣿⣶⣦⠤⠄⡠⢾⣿⣿⡿⠋⠉⠉⠻⣿⣿⡛⣦       "
	           "          ⠈⢿⣿⣟⠦ ⣾⣿⣿⣷    ⠻⠿⢿⣿⣧⣄     "
	           "           ⣸⣿⣿⢧ ⢻⠻⣿⣿⣷⣄⣀⠄⠢⣀⡀⠈⠙⠿⠄    "
	           "          ⢠⣿⣿⣿⠈    ⣻⣿⣿⣿⣿⣿⣿⣿⣛⣳⣤⣀⣀   "
	           "   ⢠⣧⣶⣥⡤⢄ ⣸⣿⣿⠘  ⢀⣴⣿⣿⡿⠛⣿⣿⣧⠈⢿⠿⠟⠛⠻⠿⠄  "
	           "  ⣰⣿⣿⠛⠻⣿⣿⡦⢹⣿⣷   ⢊⣿⣿⡏  ⢸⣿⣿⡇ ⢀⣠⣄⣾⠄   "
	           " ⣠⣿⠿⠛ ⢀⣿⣿⣷⠘⢿⣿⣦⡀ ⢸⢿⣿⣿⣄ ⣸⣿⣿⡇⣪⣿⡿⠿⣿⣷⡄  "
	           " ⠙⠃   ⣼⣿⡟  ⠈⠻⣿⣿⣦⣌⡇⠻⣿⣿⣷⣿⣿⣿ ⣿⣿⡇ ⠛⠻⢷⣄ "
	           "      ⢻⣿⣿⣄   ⠈⠻⣿⣿⣿⣷⣿⣿⣿⣿⣿⡟ ⠫⢿⣿⡆     "
	           "       ⠻⣿⣿⣿⣿⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⡟⢀⣀⣤⣾⡿⠃     "
	           "                                   "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'dysthesis/dashboard-setup)
#+end_src
** Font
Doom exposes five (optional) variables for controlling fonts in Doom:

- =doom-font=: the primary font to use
- =doom-variable-pitch-font=: a non-monospace font (where applicable)
- =doom-big-font=: used for =doom-big-font-mode=; use this for presentations or streaming.
- =doom-symbol-font=: for symbols
- =doom-serif-font=: for the =fixed-pitch-serif= face

See =C-h v doom-font= for documentation and more examples of what they accept.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 12.0 :weight 'medium)
      doom-variable-pitch-font (font-spec :family "Lato" :size 12.0 :weight 'medium))
#+end_src

*** Org-mode faces
#+begin_src emacs-lisp
(after! org (custom-set-faces!
              '(org-level-1 :foreground "#ffffff" :height 1.4 :weight bold)
              '(org-level-2 :foreground "#ffffff" :height 1.2 :weight bold)
              '(org-level-3 :foreground "#ffffff" :height 1.1 :weight bold)
              '(org-level-4 :foreground "#ffffff" :height 1.0 :weight bold)
              '(org-level-5 :foreground "#ffffff" :height 0.9 :weight bold)
              '(org-verbatim :foreground "LightGreen")
              '(org-quote :family "Lato" :height 1.0 :slant italic)
              '(org-time-grid :foreground "#ffffff")
              '(org-document-title :height 2.0 :foreground "#ffffff" :weight heavy)))
#+end_src

*** No underline for hl-line
#+begin_src emacs-lisp
(custom-set-faces!
  '(hl-line :underline nil))
#+end_src

*** Mixed pitch
#+begin_src emacs-lisp
(use-package mixed-pitch
  :hook
  ;; You might want to enable it only in org-mode or both text-mode and org-mode
  ((org-mode) . mixed-pitch-mode)
  :config
  (setq mixed-pitch-fixed-pitch-faces
        (append mixed-pitch-fixed-pitch-faces
                '(org-table
                  org-code
                  org-block
                  org-block-begin-line
                  org-block-end-line
                  org-meta-line
                  org-document-info-keyword
                  org-tag
                  org-time-grid
                  org-todo
                  org-done
                  org-agenda-date
                  org-date
                  org-drawer
                  org-modern-tag
                  org-modern-done
                  org-modern-label
                  org-scheduled
                  org-scheduled-today
                  neo-file-link-face
                  org-scheduled-previously)))
  (add-hook 'mixed-pitch-mode-hook #'solaire-mode-reset))
#+end_src

** Transparency
#+begin_src emacs-lisp
;; (set-frame-parameter nil 'alpha-background 50)
;; (add-to-list 'default-frame-alist '(alpha-background . 50))
#+end_src

** Doom theme
If you or Emacs can't find your font, use =M-x describe-font= to look them up, =M-x eval-region= to execute elisp code, and =M-x doom/reload-font= to refresh your font settings. If Emacs still can't find your font, it likely wasn't installed correctly. Font issues are rarely Doom issues!

There are two ways to load a theme. Both assume the theme is installed and available. You can either set =doom-theme= or manually load a theme with the =load-theme= function.

#+begin_src emacs-lisp
(setq doom-theme 'sweetpastel)
#+end_src

** Line numbering
This determines the style of line numbers in effect. If set to =nil=, line numbers are disabled. For relative line numbers, set this to =relative=.

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

* Ivy :inactive:
#+begin_src emacs-lisp
;;(use-package! all-the-icons-ivy-rich
;;  :init (all-the-icons-ivy-rich-mode))
#+end_src

* IMenu
#+begin_src emacs-lisp
(setq imenu-list-focus-after-activation t)
(use-package! consult)
(map! :leader
      (:prefix ("s" . "Search")
       :desc "Menu to jump to places in buffer" "i" #'consult-imenu))

(map! :leader
      (:prefix ("t" . "Toggle")
       :desc "Toggle imenu shown in a sidebar" "i" #'imenu-list-smart-toggle))
#+end_src

* Org-mode
If you use =org= and don't want your org files in the default location below, change =org-directory=. It must be set before org loads!

#+begin_src emacs-lisp
(setq org-directory "~/Org/")
#+end_src

** Basic org-mode setup
#+begin_src emacs-lisp
(after! org
  (setq org-ellipsis " ↪")
  (setq org-startup-folded t))

(defun dysthesis/org-mode-setup ()
  (olivetti-mode)
  (display-line-numbers-mode 0)
  (olivetti-set-width 80)
  (setq-local company-backends (remove 'company-dabbrev company-backends))
  (setq-local company-backends (remove 'company-ispell company-backends)))
(add-hook 'org-mode-hook 'dysthesis/org-mode-setup)
#+end_src

** Notifications
#+begin_src emacs-lisp
;; (org-wild-notifier-mode)
#+end_src
** Org capture templates
Use DOCT (Declarative Org Capture Templates) for better capture template configuration.
#+begin_src emacs-lisp
(use-package! doct
  :commands doct)
#+end_src

Declare the capture templates
#+begin_src emacs-lisp
(after! org
  (setq org-capture-templates
        (doct '((" Todo"
                 :keys "t"
                 :prepend t
                 :file "GTD/inbox.org"
                 :headline "Tasks"
                 :type entry
                 :template ("* TODO %? %{extra}")
                 :children ((" General"
                             :keys "t"
                             :extra "")
                            ("󰈸 With deadline"
                             :keys "d"
                             :extra "\nDEADLINE: %^{Deadline:}t")
                            ("󰥔 With schedule"
                             :keys "s"
                             :extra "\nSCHEDULED: %^{Start time:}t")))
                ("Bookmark"
                 :keys "b"
                 :prepend t
                 :file "bookmarks.org"
                 :type entry
                 :template "* TODO [[%:link][%:description]] :bookmark:\n\n"
                 :immediate-finish t)))))
#+end_src

Make some quick shortcuts
#+begin_src emacs-lisp
(defun dysthesis/org-capture-todo ()
  (interactive)
  (org-capture nil "tt"))
(defun dysthesis/org-capture-todo-with-deadline ()
  (interactive)
  (org-capture nil "td"))
(defun dysthesis/org-capture-todo-with-schedule ()
  (interactive)
  (org-capture nil "ts"))

(bind-key "C-c t" #'dysthesis/org-capture-todo)
(bind-key "C-c d" #'dysthesis/org-capture-todo-with-deadline)
(bind-key "C-c s" #'dysthesis/org-capture-todo-with-schedule)
#+end_src

** Archiving
#+begin_src emacs-lisp
(setq org-archive-location "~/Org/archive.org::* From =%s=")
(defun dysthesis/org-archive-done-tasks ()
  "Archive all done tasks."
  (interactive)
  (org-map-entries 'org-archive-subtree "/DONE" 'file))
#+end_src

