config.el

(defun log-todo-next-creation-date (&rest ignore)
  "Log NEXT creation time in the property drawer under the key 'ACTIVATED'"
  (when (and (string= (org-get-todo-state) "NEXT")
             (not (org-entry-get nil "ACTIVATED")))
    (org-entry-put nil "ACTIVATED" (format-time-string "[%Y-%m-%d]"))))
(add-hook 'org-after-todo-state-change-hook #'log-todo-next-creation-date)

(defun dysthesis/mark-inbox-todos ()
  "Mark entries in the agenda whose category is 'inbox' for future bulk action."
  (let ((entries-marked 0)
        (regexp "inbox")  ; Set the search term to 'inbox'
        category-at-point)
    (save-excursion
      (goto-char (point-min))
      (goto-char (next-single-property-change (point) 'org-hd-marker))
      (while (re-search-forward regexp nil t)
        (setq category-at-point (get-text-property (match-beginning 0) 'org-category))
        (if (or (get-char-property (point) 'invisible)
                (not category-at-point))  ; Skip if category is nil
            (beginning-of-line 2)
          (when (string-match-p regexp category-at-point)
            (setq entries-marked (1+ entries-marked))
            (call-interactively 'org-agenda-bulk-mark))))
      (unless entries-marked
        (message "No entry matching 'inbox'.")))))

(defun dysthesis/get-current-todo-category ()
  "Get the 'org-category' property of the TODO item at the current cursor position."
  (interactive)
  (let ((category (get-text-property (point) 'org-category)))
    (if category
        (message "Current TODO's category: %s" category)
      (message "No category found for current TODO"))))

(setq org-log-done 'time
      org-log-into-drawer t
      org-log-state-notes-insert-after-drawers nil)

(defun dysthesis/org-process-inbox ()
  "Called in org-agenda-mode, processes all inbox items."
  (interactive)
  (dysthesis/mark-inbox-todos)
  (dysthesis/bulk-process-entries))

(defvar dysthesis/org-current-effort "1:00"
  "Current effort for agenda items.")

(defun dysthesis/my-org-agenda-set-effort (effort)
  "Set the effort property for the current headline."
  (interactive
   (list (read-string (format "EFFORT [%s]: " dysthesis/org-current-effort) nil nil dysthesis/org-current-effort)))
  (setq dysthesis/org-current-effort effort)
  (org-agenda-check-no-diary)
  (let* ((hdmarker (or (org-get-at-bol 'org-hd-marker)
                       (org-agenda-error)))
         (buffer (marker-buffer hdmarker))
         (pos (marker-position hdmarker))
         (inhibit-read-only t)
         newhead)
    (org-with-remote-undo buffer
      (with-current-buffer buffer
        (widen)
        (goto-char pos)
        (org-show-context 'agenda)
        (funcall-interactively 'org-set-effort nil dysthesis/org-current-effort)
        (end-of-line 1)
        (setq newhead (org-get-heading)))
      (org-agenda-change-all-lines newhead hdmarker))))

(defun dysthesis/org-agenda-process-inbox-item ()
  "Process a single item in the org-agenda."
  (org-with-wide-buffer
   (org-agenda-set-tags)
   (org-agenda-priority)

   ;; Get the marker for the current headline
   (let* ((hdmarker (org-get-at-bol 'org-hd-marker))
          (category (completing-read "Category: " '("University" "Home" "Tinkering" "Read"))))
     ;; Switch to the buffer of the actual Org file
     (with-current-buffer (marker-buffer hdmarker)
       (goto-char (marker-position hdmarker))
       ;; Set the category property
       (org-set-property "CATEGORY" category)

       ;; Check if the current item has the 'someday' tag
       (unless (member "someday" (org-get-tags))
         ;; Prompt for scheduled and deadline times
         (let ((scheduled-time (org-read-date nil nil nil "Scheduled Time: (leave blank if none)"))
               (deadline-time (org-read-date nil nil nil "Deadline Time: (leave blank if none)")))
           ;; Set scheduled time if provided
           (when (and scheduled-time (not (string= scheduled-time "")))
             (org-schedule nil scheduled-time))
           ;; Set deadline time if provided
           (when (and deadline-time (not (string= deadline-time "")))
             (org-deadline nil deadline-time)))
         ))

   (call-interactively 'dysthesis/my-org-agenda-set-effort)
   (org-agenda-refile nil nil t))))

(defun dysthesis/bulk-process-entries ()
  (let ())
  (if (not (null org-agenda-bulk-marked-entries))
      (let ((entries (reverse org-agenda-bulk-marked-entries))
            (processed 0)
            (skipped 0))
        (dolist (e entries)
          (let ((pos (text-property-any (point-min) (point-max) 'org-hd-marker e)))
            (if (not pos)
                (progn (message "Skipping removed entry at %s" e)
                       (cl-incf skipped))
              (goto-char pos)
              (let (org-loop-over-headlines-in-active-region) (funcall 'dysthesis/org-agenda-process-inbox-item))
              ;; `post-command-hook' is not run yet.  We make sure any
              ;; pending log note is processed.
              (when (or (memq 'org-add-log-note (default-value 'post-command-hook))
                        (memq 'org-add-log-note post-command-hook))
                (org-add-log-note))
              (cl-incf processed))))
        (org-agenda-redo)
        (unless org-agenda-persistent-marks (org-agenda-bulk-unmark-all))
        (message "Acted on %d entries%s%s"
                 processed
                 (if (= skipped 0)
                     ""
                   (format ", skipped %d (disappeared before their turn)"
                           skipped))
                 (if (not org-agenda-persistent-marks) "" " (kept marked)")))))

(defun dysthesis/org-inbox-capture ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "i"))

(map! :map org-agenda-mode-map
      "i" #'org-agenda-clock-in
      "r" #'dysthesis/org-process-inbox
      "R" #'org-agenda-refile)

;; (defvar refresh-agenda-time-seconds 300)

;; (defvar refresh-agenda-timer nil
;;   "Timer for `refresh-agenda-timer-function' to reschedule itself, or nil.")

;; (defun refresh-agenda-timer-function ()
;;   ;; If the user types a command while refresh-agenda-timer
;;   ;; is active, the next time this function is called from
;;   ;; its main idle timer, deactivate refresh-agenda-timer.
;;   (when refresh-agenda-timer
;;     (cancel-timer refresh-agenda-timer))

;;   (org-agenda nil "o")

;;   (setq refresh-agenda-timer
;;     (run-with-idle-timer
;;       ;; Compute an idle time break-length
;;       ;; more than the current value.
;;       (time-add (current-idle-time) refresh-agenda-time-seconds)
;;       nil
;;       'refresh-agenda-timer-function)))

;; (run-with-idle-timer refresh-agenda-time-seconds t 'refresh-agenda-timer-function)

(add-to-list 'org-modules 'org-habit t)
(setq modus-themes-deuteranopia nil) ; try with nil too
(setq modus-themes-org-agenda
          (quote ((event . (accented italic varied))
                  (scheduled . uniform)
                  (habit . traffic-light))))
