config.org
*** Colourised calendar view
#+begin_src emacs-lisp
(defface busy-1  '((t :foreground "black" :background "#eceff1")) "")
(defface busy-2  '((t :foreground "black" :background "#cfd8dc")) "")
(defface busy-3  '((t :foreground "black" :background "#b0bec5")) "")
(defface busy-4  '((t :foreground "black" :background "#90a4ae")) "")
(defface busy-5  '((t :foreground "white" :background "#78909c")) "")
(defface busy-6  '((t :foreground "white" :background "#607d8b")) "")
(defface busy-7  '((t :foreground "white" :background "#546e7a")) "")
(defface busy-8  '((t :foreground "white" :background "#455a64")) "")
(defface busy-9  '((t :foreground "white" :background "#37474f")) "")
(defface busy-10 '((t :foreground "white" :background "#263238")) "")
(defadvice calendar-generate-month
    (after highlight-weekend-days (month year indent) activate)
  "Highlight weekend days"
  (dotimes (i 31)
    (let* ((org-files (directory-files-recursively "~/Org/GTD" "\\.org$"))
           (date (list month (1+ i) year))
           (count 0))
      (dolist (file org-files)
        (setq count (+ count (length (org-agenda-get-day-entries file date)))))
      (cond ((= count 0) ())
            ((= count 1) (calendar-mark-visible-date date 'busy-1))
            ((= count 2) (calendar-mark-visible-date date 'busy-2))
            ((= count 3) (calendar-mark-visible-date date 'busy-3))
            ((= count 4) (calendar-mark-visible-date date 'busy-4))
            ((= count 5) (calendar-mark-visible-date date 'busy-5))
            ((= count 6) (calendar-mark-visible-date date 'busy-6))
            ((= count 7) (calendar-mark-visible-date date 'busy-7))
            ((= count 8) (calendar-mark-visible-date date 'busy-8))
            ((= count 9) (calendar-mark-visible-date date 'busy-9))
            (t  (calendar-mark-visible-date date 'busy-10)))
      )))
#+end_src

** Org-super-agenda
*** Setup
#+begin_src emacs-lisp
(after! org-agenda
  (setq org-super-agenda-keep-order t))
#+end_src

*** Agenda views
#+begin_src emacs-lisp
(after! org-agenda
  (let ((inhibit-message t))
    (org-super-agenda-mode)))

(setq org-agenda-custom-commands
      '(("o" "Overview"
         ((agenda "" ((org-agenda-span 'day)
                      (org-super-agenda-groups
                       '((:name "Today"
                          :time-grid t
                          :deadline today
                          :scheduled today
                          :order 0)
                         (:habit t
                          :order 1)
                         (:name "Overdue"
                          :deadline past
                          :scheduled past
                          :order 2)
                         (:name "Upcoming"
                          :time-grid t
                          :scheduled future
                          :deadline future
                          :order 3)))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '((:name "Ongoing"
                           :todo "PROG"
                           :order 0)
                          (:name "Up next"
                           :todo "NEXT"
                           :order 1)
                          (:name "Waiting"
                           :todo "WAIT"
                           :order 2)
                          (:name "Important"
                           :priority "A"
                           :order 3)
                          (:name "Inbox"
                           :file-path "inbox"
                           :order 4)
                          (:name "University"
                           :category "University"
                           :tag ("university"
                                 "uni"
                                 "assignment"
                                 "exam")
                           :order 5)
                          (:name "Tinkering"
                           :category "Tinkering"
                           :tag ("nix"
                                 "nixos"
                                 "gentoo"
                                 "emacs"
                                 "tinker")
                           :order 6)
                          (:name "Reading list"
                           :category "Read"
                           :tag "read"
                           :order 6)))))))))
(defun dysthesis/agenda ()
  (interactive)
  (org-agenda nil "o"))

(use-package! org-agenda
  :init
  (map! "C-c a" #'dysthesis/agenda))
#+end_src

** Org-roam
A plain-text personal knowledge management system. Mimics the bidirectional linking capabilities of note-taking apps like Roam Research, Obsidian, or Logseq.

*** Initialisation
Initialise Org-roam and use v2.
#+begin_src emacs-lisp
(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
#+end_src

*** Variables
**** Roam directory
Define a directory to place Org-roam notes in
#+begin_src emacs-lisp
  :custom
  (org-roam-directory "~/Org/Roam")
#+end_src

**** Org-roam-dailies
Define capture templates and the directory for Org-roam-dailies.
#+begin_src emacs-lisp
  (org-roam-dailies-capture-templates
      '(("d" "default" entry "* %<%H:%M> %?"
         :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
  (org-roam-dailies-directory "Daily/")
#+end_src

****  Completion
Enable completion everywhere.
#+begin_src emacs-lisp
  (org-roam-completion-everywhere t)
#+end_src

*** Keybinding

| Keybinding       | Function name                      | Description                                                       |
|------------------+------------------------------------+-------------------------------------------------------------------|
| =C-c n l=          | =org-roam-buffer-toggle=             | Toggle the org-roam side buffer                                   |
| =C-c n f=          | =org-roam-node-find=                 | Find an org-roam node and open it                                 |
| =C-c n i= or =C-c i= | =org-roam-node-insert=               | Insert a link to an org-roam node                                 |
| =C-c n q=          | =org-roam-node-insert-immediate=     | Insert a link to an org-roam node without opening the edit buffer |
| =C-c n t=          | =org-roam-node-tag-add=              | Add a new tag to the current org-roam node                        |
| =C-c n c=          | =org-roam-capture=                   | Capture to an org-roam node                                       |
| =C-c n a=          | =org-roam-alias-add=                 | Add an alias to the current org-roam node                         |
| =C-M-i=            | =completion-at-point=                |                                                                   |
| =C-c n d t=        | =org-roam-dailies-capture-tomorrow=  | Capture to tomorrow's org-roam-dailies entry                      |
| =C-c n d y=        | =org-roam-dailies-capture-yesterday= | Capture to yesterday's org-roam-dailies entry                     |
| =C-c n d d=        | =org-roam-dailies-capture-today=     | Capture to today's org-roam-dailies entry                         |

#+begin_src emacs-lisp
  :bind
  (("C-c n l" . org-roam-buffer-toggle)
       ("C-c n f" . org-roam-node-find)
       ("C-c n i" . org-roam-node-insert)
       ("C-c i" . org-roam-node-insert)
       ("C-c n q" . org-roam-node-insert-immediate)
       ("C-c n t" . org-roam-tag-add)
       ("C-c n c" . org-roam-capture)
       ("C-c n a" . org-roam-alias-add)
       :map org-mode-map
       ("C-M-i"    . completion-at-point)
       :map org-roam-dailies-map
       ("y" . org-roam-dailies-capture-yesterday)
       ("t" . org-roam-dailies-capture-tomorrow))
  :bind-keymap
  ("C-c n d" . org-roam-dailies-map)
#+end_src

*** Configuration
Enable autosynchronisation of the Org-roam database.
#+begin_src emacs-lisp
  :config
  (org-roam-db-autosync-enable)
#+end_src

Force org-roam to use org-roam-dailies.
#+begin_src emacs-lisp
  (require 'org-roam-dailies)
#+end_src

**** Popup rules
#+begin_src emacs-lisp
  (set-popup-rules!
  `((,(regexp-quote org-roam-buffer) ; persistent org-roam buffer
     :side right :width .33 :height .5 :ttl nil :modeline nil :quit nil :slot 1)
    ("^\\*org-roam: " ; node dedicated org-roam buffer
     :side right :width .33 :height .5 :ttl nil :modeline nil :quit nil :slot 2))))
#+end_src

