config.org
*** Capture templates
#+begin_src emacs-lisp
(setq org-roam-capture-templates
      '(("d" " Default" plain
         "%?"
         :if-new (file+head "${slug}.org"
                            "#+title: ${title}\n#+filetags: :new:\n#+STARTUP: latexpreview")
         :immediate-finish t
         :unnarrowed t)
        ("i" "󰆼 Index note" plain
         "%?"
         :if-new (file+head "${slug}.org"
                            "#+title: ${title}\n#+filetags: :new:index:")
         :immediate-finish t
         :unarrowed t)
        ("e" "󰖟 Elfeed" plain
         "%?"
         :target (file+head "Elfeed/${slug}.org"
                            "#+title: ${title}\n#+filetags: :new:article:rss:\n#+STARTUP: latexpreview"
                            ;;"#+filetags: :article:rss:\n"
                            )
         :unnarrowed t)
        ("l" "󰙨 Literature note" plain
         "%?"
         :target
         (file+head
          "%(expand-file-name (or citar-org-roam-subdir \"\") org-roam-directory)/Literature/${citar-citekey}.org"
          "#+title: ${note-title}.\n#+filetags: :new:\n#+created: %U\n#+last_modified: %U\n#+STARTUP: latexpreview\n\n* Annotations\n:PROPERTIES:\n:Custom_ID: ${citar-citekey}\n:NOTER_DOCUMENT: ${citar-file}\n:NOTER_PAGE: \n:END:\n\n")
         :unnarrowed t)
        ("d" " Idea" plain "%?"
         :if-new
         (file+head "${slug}.org" "#+title: ${title}\n#+filetags: :idea:new:\n#+STARTUP: latexpreview\n")
         :immediate-finish t
         :unnarrowed t)))
#+end_src
*** Quick note insertions without opening the new note buffer
This can be bound to any keybinding to quickly insert a new Org-roam note at the current point without opening the new note buffer, allowing you to just add the contents of it later.

#+begin_src emacs-lisp
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
#+end_src

*** Org-roam-UI
A nice graph view to visualise connections in Org-roam notes. Similar to that of Obsidian or Logseq.

*Issue.* There appears to be an issue with XWidgets on NixOS, something to do with OpenGL. Therefore, for now, org-roam-ui /must/ be used inside a browser, by opening =http://127.0.0.1:35901/=.

#+begin_src emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
  :after org ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        ;; org-roam-ui-browser-function #'xwidget-webkit-browse-url ;; OpenGL issue on NixOS
        org-roam-ui-open-on-start t
        org-roam-ui-custom-theme
        '((bg-alt . "#181825")
          (bg . "#11111b")
          (fg . "#cdd6f4")
          (fg-alt . "#cdd6f4")
          (red . "#f38ba8")
          (orange . "#fab387")
          (yellow ."#f9e2af")
          (green . "#a6e3a1")
          (cyan . "#94e2d5")
          (blue . "#89b4fa")
          (violet . "#8be9fd")
          (magenta . "#f5c2e7"))))
#+end_src

*** Org-roam-dailies
Journaling made easy with Org-roam.

First, define the subfolder that daily notes should be stored in. This will be defined with respect to the =org-roam-directory=.
#+begin_src emacs-lisp
(setq org-roam-dailies-directory "Daily/")
#+end_src

*** Create a new task when a new note is made
#+begin_src emacs-lisp
(defun dysthesis/org-roam-capture-default
    (interactive)
  (org-roam-capture nil "d"))

#+end_src

*** Reviewing org-roam files
**** Filtering for =new= files.
#+begin_src emacs-lisp
(defun dysthesis/org-roam-find-new-notes ()
  (lambda (node)
    (member "new" (org-roam-node-tags node))))

(defun dysthesis/org-roam-process-notes ()
  (interactive)
  (org-roam-node-find nil nil (dysthesis/org-roam-find-new-notes)))

(bind-key "C-c m" #'dysthesis/org-roam-process-notes)
#+end_src

**** Getting rid of the =new= tags
#+begin_src emacs-lisp
(defun dysthesis/remove-new-tag ()
  "Remove the 'new' tag from the current Org-roam file."
  (interactive)
  (when (and (buffer-file-name) (org-roam-file-p))
    ;; Check if the 'new' tag is present and remove it
    (save-excursion
      (goto-char (point-min))
      (let ((tag-regex ":new:"))
        (while (re-search-forward tag-regex nil t)
          (replace-match ":")
          (save-buffer))))))

(bind-key "C-c r" #'dysthesis/remove-new-tag)
#+end_src

** Org-journal

** Miscellaneous
*** Org-protocol
#+begin_src emacs-lisp
(server-start)
(add-to-list 'load-path "~/Org/bookmark.org")
(require 'org-protocol)
#+end_src
*** Org-noter
Take notes for PDFs.

#+begin_src emacs-lisp
(use-package org-noter
  :after (:any org pdf-view)
  :config
  (setq
   ;; Please stop opening frames
   org-noter-always-create-frame nil
   ;; I want to see the whole file
   org-noter-hide-other nil
   ;; Everything is relative to the main notes file
   org-noter-notes-search-path (list org-directory)
   ))
#+end_src

*** Citations
**** Org-ref
#+begin_src emacs-lisp
(use-package! org-ref
    ;:after org-roam
    :config
    (setq
     org-ref-get-pdf-filename-function
      (lambda (key) (car (bibtex-completion-find-pdf key)))
     org-ref-default-bibliography (list "~/Org/Library.bib")
     ;;org-ref-bibliography-notes "~/Org/Roam/Literature/bibnotes.org"
     org-ref-pdf-directory "~/Documents/Library/files"
     org-ref-note-title-format "* %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
     org-ref-notes-directory "~/Org/Roam/Literature"
     org-ref-notes-function 'orb-edit-notes))

(after! org-ref
(setq
 bibtex-completion-notes-path "~/Org/Roam/Literature/"
 bibtex-completion-bibliography "~/Org/Library.bib"
 bibtex-completion-library-path "~/Documents/Library/files/"
 bibtex-completion-pdf-field "file"
 bibtex-completion-notes-template-multiple-files
 (concat
  "#+TITLE: ${title}\n"
  "#+ROAM_KEY: cite:${=key=}\n"
  "* TODO Notes\n"
  ":PROPERTIES:\n"
  ":CUSTOM_ID: ${=key=}\n"
  ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
  ":AUTHOR: ${author-abbrev}\n"
  ":JOURNAL: ${journaltitle}\n"
  ":DATE: ${date}\n"
  ":YEAR: ${year}\n"
  ":DOI: ${doi}\n"
  ":URL: ${url}\n"
  ":END:\n\n"
  )
 )
)
#+end_src

**** Citar-org-roam
#+begin_src emacs-lisp
(use-package citar
  :custom
  (citar-bibliography '("~/Org/Library.bib"))
  :hook
  (LaTeX-mode . citar-capf-setup)
  (org-mode . citar-capf-setup))

(setq citar-templates
      '((main . "${author editor:30%sn}     ${date year issued:4}     ${title:48}")
        (suffix . "          ${=key= id:15}    ${=type=:12}    ${tags keywords:*}")
        (preview . "${author editor:%etal} (${year issued date}) ${title}, ${journal journaltitle publisher container-title collection-title}.\n")
        (note . "Notes on ${author editor:%etal}, ${title}")))

(setq citar-org-roam-template-fields
  '((:citar-title . ("title"))
    (:citar-author . ("author" "editor"))
    (:citar-date . ("date" "year" "issued"))
    (:citar-pages . ("pages"))
    (:citar-type . ("=type="))
    (:citar-file . ("file"))))

(use-package citar-org-roam
  :after (citar org-roam)
  :config (citar-org-roam-mode))
(setq citar-org-roam-capture-template-key "l")
(setq citar-org-roam-note-title-template "${author} - ${title}")

(bind-key "C-c o" #'citar-open)
#+end_src
**** Org
#+begin_src emacs-lisp
(defun my-citar-org-open-notes (key entry)
  (let* ((bib (string-join (list my/bibtex-directory key ".bib")))
         (org (string-join (list my/bibtex-directory key ".org")))
         (new (not (file-exists-p org))))
    (funcall citar-file-open-function org)
    (when (and new (eq (buffer-size) 0))
      (insert (format template
                      (assoc-default "title" entry)
                      user-full-name
                      user-mail-address
                      bib
                      (with-temp-buffer
                        (insert-file-contents bib)
                        (buffer-string))))
      (search-backward "|")
      (delete-char 1))))

(setq-default citar-open-note-function 'my-citar-org-open-notes)
#+end_src

