config.org
** Capture to Org-roam
#+begin_src emacs-lisp
(defun dysthesis/elfeed-capture-entry ()
  (interactive)
  ;; Check if we are in elfeed-show-mode
  (if (eq major-mode 'elfeed-show-mode)
      (let* ((entry elfeed-show-entry)  ; Get the current entry in elfeed-show
             (link (elfeed-entry-link entry))
             (title (elfeed-entry-title entry)))
        ;; Initiate an Org-roam capture
        (org-roam-capture- :keys "e" :node (org-roam-node-create :title title))
        (insert link))  ; Insert only the URL
    (message "Not in elfeed-show mode!")))
#+end_src

* Beancount
Finance tracking in Emacs.
#+begin_src emacs-lisp
(use-package! beancount
  :mode ("\\.beancount\\'" . beancount-mode)
  :init
  (after! all-the-icons
    (add-to-list 'all-the-icons-icon-alist
                 '("\\.beancount\\'" all-the-icons-material "attach_money" :face all-the-icons-lblue))
    (add-to-list 'all-the-icons-mode-icon-alist
                 '(beancount-mode all-the-icons-material "attach_money" :face all-the-icons-lblue)))
  :config
  (setq beancount-electric-currency t)
  (defun beancount-bal ()
    "Run bean-report bal."
    (interactive)
    (let ((compilation-read-command nil))
      (beancount--run "bean-report"
                      (file-relative-name buffer-file-name) "bal")))
  (map! :map beancount-mode-map
        :n "TAB" #'beancount-align-to-previous-number
        :i "RET" (cmd! (newline-and-indent) (beancount-align-to-previous-number))))
#+end_src

Stop =electric-indent= and =agressive-indent= from messing up Beancount's indenting.
#+begin_src emacs-lisp
(add-hook 'beancount-mode-hook
          (lambda () (setq-local electric-indent-chars nil)))
#+end_src

Activate =outline-minor-mode= for better navigation of Beancount files.
#+begin_src emacs-lisp
(add-hook 'beancount-mode-hook #'outline-minor-mode)
#+end_src

* LSP
** Nix
#+begin_src emacs-lisp
(use-package lsp-mode
  :ensure t)

(use-package nix-mode
  :hook (nix-mode . lsp-deferred)
  :ensure t)
#+end_src

*** Use Alejandra instead of nix-fmt
#+begin_src emacs-lisp
(set-formatter! 'alejandra '("alejandra" "--quiet") :modes '(nix-mode))

(after! apheleia
  (push '(alejandra . ("alejandra" "-")) apheleia-formatters)
  (setf (alist-get 'nix apheleia-mode-alist) 'alejandra))
#+end_src

** LSP UI
#+begin_src emacs-lisp
(use-package lsp-ui
  :init
  (setq lsp-ui-doc-enable nil)
  :bind (:map lsp-ui-mode-map
              ("C-c i" . lsp-ui-imenu)))
(add-hook! 'prog-mode-hook 'lsp-ui-mode)
#+end_src

* Company
Short for complete-anything, company is responsible for code completion in Doom Emacs.

To get code completion while working in a code block, use =C-c '= to open a new dedicated buffer with your cursor in the code block. When done, exit with =C-c C-c=.

#+begin_src emacs-lisp
(after! company
  (setq company-minimum-prefix-length 1
        company-idle-delay 0.05))
(set-company-backend! 'org-mode
      '(:separate company-capf
        :separate company-org-roam
        :separate company-yasnippet
        :separate company-files))
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src
* Miscellaneous
** Rainbow mode
#+begin_src
(rainbow-mode 1)
#+end_src

** Aggressive indent mode
Automatically keep code properly indented and aligned, more agressive than electric-indent-mode.

#+begin_src emacs-lisp
(global-aggressive-indent-mode 1)
(add-to-list 'aggressive-indent-excluded-modes 'html-mode)
#+end_src

** Better copy-paste keybinds
#+begin_src emacs-lisp
(map! :ne "C-S-c" #'kill-ring-save
      :ne "C-S-v" #'yank)
#+end_src

** Default shell
#+begin_src emacs-lisp
(setq-default shell-file-name (executable-find "dash"))
#+end_src
