config.el
  ;; Check if we are in elfeed-show-mode
  (if (eq major-mode 'elfeed-show-mode)
      (let* ((entry elfeed-show-entry)  ; Get the current entry in elfeed-show
             (link (elfeed-entry-link entry))
             (title (elfeed-entry-title entry)))
        ;; Initiate an Org-roam capture
        (org-roam-capture- :keys "e" :node (org-roam-node-create :title title))
        (insert link))  ; Insert only the URL
    (message "Not in elfeed-show mode!")))

(use-package! beancount
  :mode ("\\.beancount\\'" . beancount-mode)
  :init
  (after! all-the-icons
    (add-to-list 'all-the-icons-icon-alist
                 '("\\.beancount\\'" all-the-icons-material "attach_money" :face all-the-icons-lblue))
    (add-to-list 'all-the-icons-mode-icon-alist
                 '(beancount-mode all-the-icons-material "attach_money" :face all-the-icons-lblue)))
  :config
  (setq beancount-electric-currency t)
  (defun beancount-bal ()
    "Run bean-report bal."
    (interactive)
    (let ((compilation-read-command nil))
      (beancount--run "bean-report"
                      (file-relative-name buffer-file-name) "bal")))
  (map! :map beancount-mode-map
        :n "TAB" #'beancount-align-to-previous-number
        :i "RET" (cmd! (newline-and-indent) (beancount-align-to-previous-number))))

(add-hook 'beancount-mode-hook
          (lambda () (setq-local electric-indent-chars nil)))

(add-hook 'beancount-mode-hook #'outline-minor-mode)

(use-package lsp-mode
  :ensure t)

(use-package nix-mode
  :hook (nix-mode . lsp-deferred)
  :ensure t)

(set-formatter! 'alejandra '("alejandra" "--quiet") :modes '(nix-mode))

(after! apheleia
  (push '(alejandra . ("alejandra" "-")) apheleia-formatters)
  (setf (alist-get 'nix apheleia-mode-alist) 'alejandra))

(use-package lsp-ui
  :init
  (setq lsp-ui-doc-enable nil)
  :bind (:map lsp-ui-mode-map
              ("C-c i" . lsp-ui-imenu)))
(add-hook! 'prog-mode-hook 'lsp-ui-mode)

(after! company
  (setq company-minimum-prefix-length 1
        company-idle-delay 0.05))
(set-company-backend! 'org-mode
      '(:separate company-capf
        :separate company-org-roam
        :separate company-yasnippet
        :separate company-files))
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)

(global-aggressive-indent-mode 1)
(add-to-list 'aggressive-indent-excluded-modes 'html-mode)

(map! :ne "C-S-c" #'kill-ring-save
      :ne "C-S-v" #'yank)

(setq-default shell-file-name (executable-find "dash"))
